#Реализовать функцию для транскодирования данных, содержащих битовые поля. В решении необходимо использовать побитовые операции.
def main(number):
    ans = 0
    tb = bin(number)[2:]
    print(tb)
    i1 = tb[0:5]
    i2 = tb[6:8]
    i3 = tb[9:11]
    i4 = tb[12:18]
    i5 = tb[19:22]
    i6 = tb[23:33]

    ii1 = int(i1, 2) << 0
    ii2 = int(i2, 2) << 16
    ii3 = int(i3, 2) << 30
    ii4 = int(i4, 2) << 23
    ii5 = int(i5, 2) << 19
    ii6 = int(i6, 2) << 6

    ans = ii1 + ii2 + ii3 + ii4 + ii5 + ii6

    return (ans)






print(main(2893096156)) # 2306037276
# print(main(8228658565)) # 2306037276
